Ran Plan for 2 projects:

1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
1. project: `dev` dir: `deployment/dev/terraform` workspace: `default`
---

### 1. project: `prod` dir: `deployment/prod/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_secret_manager_secret.backstage-bits-credentials["backstage-insights-token"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"                 = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "service"                    = "backstage-insights-plugin"
+           "terraform-module"           = "terraform-bits-backstage-prod"
+           "type"                       = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "backstage-insights-plugin"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "backstage-insights-token"
+       terraform_labels      = {
+           "created-by"                 = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "service"                    = "backstage-insights-plugin"
+           "terraform-module"           = "terraform-bits-backstage-prod"
+           "type"                       = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["backstage-license-key"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"                 = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "service"                    = "backstage"
+           "terraform-module"           = "terraform-bits-backstage-prod"
+           "type"                       = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "backstage"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "backstage-license-key"
+       terraform_labels      = {
+           "created-by"                 = "terraform"
+           "goog-terraform-provisioned" = "true"
+           "service"                    = "backstage"
+           "terraform-module"           = "terraform-bits-backstage-prod"
+           "type"                       = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret_iam_member.ksa-access["auth-github-client-id"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "auth-github-client-id"
    }

  # google_secret_manager_secret_iam_member.ksa-access["auth-github-client-secret"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "auth-github-client-secret"
    }

  # google_secret_manager_secret_iam_member.ksa-access["auth-google-client-id"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "auth-google-client-id"
    }

  # google_secret_manager_secret_iam_member.ksa-access["auth-google-client-secret"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "auth-google-client-secret"
    }

  # google_secret_manager_secret_iam_member.ksa-access["backstage-insights-token"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "backstage-insights-token"
    }

  # google_secret_manager_secret_iam_member.ksa-access["backstage-license-key"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "backstage-license-key"
    }

  # google_secret_manager_secret_iam_member.ksa-access["github-app-backstage-bits-credentials"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "github-app-backstage-bits-credentials"
    }

  # google_secret_manager_secret_iam_member.ksa-access["pagerduty-client-id"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "pagerduty-client-id"
    }

  # google_secret_manager_secret_iam_member.ksa-access["pagerduty-client-secret"] will be created
+ resource "google_secret_manager_secret_iam_member" "ksa-access" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "principal://iam.googleapis.com/projects/864716322442/locations/global/workloadIdentityPools/bits-gke-clusters.svc.id.goog/subject/ns/backstage/sa/backstage"
+       project   = "bits-backstage-prod"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "pagerduty-client-secret"
    }

  # postgresql_grant.database_connect["backstage_plugin_backstage-insights"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_backstage-insights"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_backstage-insights"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_backstage-insights"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_backstage-insights"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_backstage-insights"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = "backstage@bits-backstage-prod.iam"
+       schema            = "public"
+       with_grant_option = false
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_backstage-insights"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_backstage-insights"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fprod%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 15 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```